#vi: syntax=ruby
cask_args appdir: '/Applications', force: true

tap 'caskroom/cask'
tap 'universal-ctags/universal-ctags'

brew 'aria2'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'git'
brew 'gnu-sed'
brew 'httpie'
brew 'mas'
brew 'mtr'
brew 'pyenv'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'readline'
brew 'redis'
brew 'stow'
brew 'the_silver_searcher'
brew 'tree'
brew 'universal-ctags', args: ['HEAD']
brew 'wget'
brew 'xz'
brew 'zsh-syntax-highlighting'

cask '0xed'
cask 'dash'
cask 'docker'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'gitup'
cask 'google-japanese-ime'
cask 'google-chrome-beta'
cask 'google-chrome-canary'
cask 'google-photos-backup'
cask 'iina'
cask 'imageoptim'
cask 'istat-menus'
cask 'iterm2'
cask 'kap'
cask 'kitematic'
cask 'macdown'
cask 'macvim'
cask 'medis'
cask 'mplayerx'
cask 'paw'
cask 'psequel'
cask 'rowanj-gitx'
cask 'safari-technology-preview'
cask 'sequel-pro'
cask 'skype'
cask 'spotify'
cask 'sublime-text'
cask 'typora'
cask 'unicodechecker'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

mas 'Debit & Credit', id: 882637653
mas 'The Unarchiver', id: 425424353
mas 'ForkLift', id: 412448059

mas 'Slack', id: 803453959
mas 'LINE', id: 539883307
mas 'Telegram', id: 747648890

mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694

mas 'Xcode', id: 497799835
mas 'Base', id: 402383384
mas 'TermHere', id: 1114363220
mas 'Sip', id: 507257563
mas 'Pixelmator', id: 407963104
