#vi: syntax=ruby
tap 'homebrew/cask-fonts'

brew 'colordiff'
brew 'diff-so-fancy'
brew 'dust' # du alternative
brew 'exa' # ls alternative
brew 'svn' # certain fonts use this
brew 'fish'
brew 'git'
brew 'mtr'
brew 'stow'
brew 'the_silver_searcher'
brew 'wget'
brew 'xz'
brew 'z'
brew 'shellcheck'

# Fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-input'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-ibm-plex-mono'
cask 'font-jetbrains-mono'
cask 'font-sf-mono'
