edc/bass
oh-my-fish/theme-default
fisherman/fzy
fisherman/getopts
fisherman/git_util
fisherman/nvm
fisherman/rbenv
fisherman/z
