#vi: syntax=ruby

brew 'bat'
brew 'diff-so-fancy'
brew 'dust' # du alternative
brew 'eza' # ls alternative
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'gum'
brew 'htop'
brew 'jq'
brew 'lazygit'
brew 'mise'
brew 'neovim'
brew 'ripgrep'
brew 'shellcheck'
brew 'socat'
brew 'starship'
brew 'television'
brew 'wget'
brew 'xz'
brew 'zoxide'

# Fonts
cask 'font-adwaita'
cask 'font-atkinson-hyperlegible-mono'
cask 'font-atkinson-hyperlegible-next'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-fira-sans'
cask 'font-go'
cask 'font-geist-mono'
cask 'font-google-sans-code'
cask 'font-hack'
cask 'font-ibm-plex-mono'
cask 'font-ibm-plex-sans-jp'
cask 'font-ibm-plex-sans-tc'
cask 'font-ibm-plex-serif'
cask 'font-inconsolata'
cask 'font-input'
cask 'font-jetbrains-mono'
cask 'font-maple-mono'
cask 'font-maple-mono-nl'
cask 'font-maple-mono-normal'
cask 'font-maple-mono-normal-nl'
cask 'font-monaspace'
cask 'font-monaspace-frozen'
cask 'font-mononoki'
cask 'font-sf-mono'
cask 'font-source-code-pro'
cask 'font-symbols-only-nerd-font'

cask '1password-cli'
cask 'mitmproxy'
